Revit 2026 API

# RebarShapeConstraintAngleFromFixedDir Class

---

A constraint which can be applied to a RebarShapeSegment and drives the angle of the segment relative to a fixed direction in UV-space.

SystemObject Autodesk.Revit.DB.StructureRebarShapeConstraint Autodesk.Revit.DB.StructureRebarShapeConstraintAngleFromFixedDir

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class RebarShapeConstraintAngleFromFixedDir : RebarShapeConstraint
```
```vb
Public Class RebarShapeConstraintAngleFromFixedDir
	Inherits RebarShapeConstraint
```
```cpp
public ref class RebarShapeConstraintAngleFromFixedDir : public RebarShapeConstraint
```
```fsharp
type RebarShapeConstraintAngleFromFixedDir =
    class
        inherit RebarShapeConstraint
    end
```

The RebarShapeConstraintAngleFromFixedDir type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | RebarShapeConstraintAngleFromFixedDir | Create an angular constraint. |

|  | Name | Description |
| --- | --- | --- |
|  | Direction | A fixed direction in UV-space. The parameter will drive the segment's angle relative to this direction. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from RebarShapeConstraint) |
|  | Sign | When the sign is 1, the Direction is rotated clockwise by the angle's value. When -1, the Direction is rotated counter-clockwise. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | (Inherited from RebarShapeConstraint) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetParamId | Return the Id of the parameter associated with this constraint. (Inherited from RebarShapeConstraint) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Structure Namespace